Repository: AldenClark/pushgo
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, zh_hans, zh_hant

source: %lld related events
de: %lld zugehörige Ereignisse
es: %lld eventos relacionados
fr: %lld événements associés
ja: 関連イベント %lld 件
ko: 관련 이벤트 %lld개
zh_hans: %lld 条关联事件
zh_hant: %lld 條關聯事件

source: %lld states
de: %lld Zustände
es: %lld estados
fr: %lld états
ja: 状態 %lld 件
ko: 상태 %lld개
zh_hans: %lld 个状态
zh_hant: %lld 個狀態

source: %lld updates
de: %lld Aktualisierungen
es: %lld actualizaciones
fr: %lld mises à jour
ja: 更新 %lld 件
ko: 업데이트 %lld개
zh_hans: %lld 次更新
zh_hant: %lld 次更新

source: A stable object view: profile, standardized attributes, and linked event streams.
de: Eine stabile Objektansicht: Profil, standardisierte Attribute und verknüpfte Ereignisverläufe.
es: Una vista estable del objeto: perfil, atributos estandarizados y flujos de eventos vinculados.
fr: Une vue objet stable : profil, attributs standardisés et flux d’événements liés.
ja: プロフィール、標準化属性、関連イベントストリームを統合した安定的なオブジェクト表示。
ko: 프로필, 표준화 속성, 연관 이벤트 스트림을 묶은 안정적인 오브젝트 뷰.
zh_hans: 稳定的对象视图：聚合档案、标准化属性与关联事件流。
zh_hant: 穩定的物件視圖：聚合檔案、標準化屬性與關聯事件流。

source: Add channel
de: Kanal hinzufügen
es: Agregar canal
fr: Ajouter un canal
ja: チャンネルを追加
ko: 채널 추가
zh_hans: 添加频道
zh_hant: 新增頻道

source: Add custom ringtone
de: Benutzerdefinierten Klingelton hinzufügen
es: Agregar tono personalizado
fr: Ajouter une sonnerie personnalisée
ja: カスタム着信音を追加
ko: 사용자 지정 벨소리 추가
zh_hans: 添加自定义铃声
zh_hant: 新增自訂鈴聲

source: AES-GCM configured
de: AES-GCM konfiguriert
es: AES-GCM configurado
fr: AES-GCM configuré
ja: AES-GCM を設定済み
ko: AES-GCM 설정 완료
zh_hans: 已配置 AES-GCM
zh_hant: 已配置 AES-GCM

# after_configuration_push_content_can_be_decrypted_locally
source: After setup, push content can be decrypted locally
de: Nach der Einrichtung kann Push-Inhalt lokal entschlüsselt werden
es: Tras la configuración, el contenido push puede descifrarse localmente
fr: Après configuration, le contenu push peut être déchiffré localement
ja: 設定後はローカルで復号できます
ko: 설정 후 로컬에서 복호화 가능
zh_hans: 配置后可在本地解密推送内容
zh_hant: 配置後可在本地解密推送內容

# airy_bubble_pop
source: Light bubble pop
de: Leichter Bubble-Pop-Ton
es: Pop de burbuja ligero
fr: Pop léger type bulle
ja: 軽いバブルポップ
ko: 가벼운 버블 팝
zh_hans: 轻盈气泡声
zh_hant: 輕盈氣泡聲

source: All
de: Alle
es: Todo
fr: Tout
ja: すべて
ko: 전체
zh_hans: 全部
zh_hant: 全部

# all_groups
source: All channels
de: Alle Kanäle
es: Todos los canales
fr: Tous les canaux
ja: すべてのチャンネル
ko: 모든 채널
zh_hans: 所有频道
zh_hant: 所有頻道

source: All messages cleared
de: Alle Nachrichten gelöscht
es: Todos los mensajes eliminados
fr: Tous les messages ont été supprimés
ja: 全メッセージを削除しました
ko: 모든 메시지 삭제 완료
zh_hans: 已清空所有消息
zh_hant: 已清空所有訊息

# already_turned_on
source: Already on
de: Bereits aktiviert
es: Ya activado
fr: Déjà activé
ja: すでにオン
ko: 이미 켜짐
zh_hans: 已开启
zh_hant: 已開啟

source: APNs token cannot be empty
de: APNs-Token darf nicht leer sein
es: El token APNs no puede estar vacío
fr: Le token APNs ne peut pas être vide
ja: APNsトークンを入力してください
ko: APNs 토큰을 비울 수 없습니다
zh_hans: APNs 令牌不能为空
zh_hant: APNs 權杖不能為空

# apns_token_contains_illegal_characters_placeholder
source: APNs token has invalid character: %@
de: APNs-Token enthält ungültiges Zeichen: %@
es: El token APNs contiene un carácter inválido: %@
fr: Le token APNs contient un caractère invalide : %@
ja: APNsトークンに不正な文字: %@
ko: APNs 토큰에 잘못된 문자 있음: %@
zh_hans: APNs 令牌包含非法字符：%@
zh_hant: APNs 權杖包含非法字元：%@

# apns_token_length_must_be_an_even_number
source: APNs token length must be even
de: Länge des APNs-Tokens muss gerade sein
es: La longitud del token APNs debe ser par
fr: La longueur du token APNs doit être paire
ja: APNsトークンの長さは偶数である必要があります
ko: APNs 토큰 길이는 짝수여야 합니다
zh_hans: APNs 令牌长度必须为偶数
zh_hant: APNs 權杖長度必須為偶數

# app_group_unavailable_for_ringtone
source: Unable to access shared directory; please check App Group settings
de: Gemeinsames Verzeichnis nicht zugänglich; App-Group-Einstellungen prüfen
es: No se puede acceder al directorio compartido; revisa la configuración de App Group
fr: Impossible d’accéder au répertoire partagé ; vérifiez les réglages App Group
ja: 共有ディレクトリにアクセスできません。App Group を確認してください
ko: 공유 디렉터리에 접근할 수 없습니다. App Group 설정을 확인하세요
zh_hans: 无法访问共享目录，请检查 App Group 配置
zh_hant: 無法訪問共享目錄，請檢查 App Group 設定

source: Apple Watch has switched to standalone mode and is preparing direct reception. iPhone will keep syncing messages until the watch is ready.
de: Apple Watch hat in den Standalone-Modus gewechselt und bereitet den Direktempfang vor. Das iPhone synchronisiert weiter, bis die Uhr bereit ist.
es: Apple Watch cambió al modo independiente y está preparando la recepción directa. El iPhone seguirá sincronizando mensajes hasta que el reloj esté listo.
fr: Apple Watch est passée en mode autonome et prépare la réception directe. L’iPhone continue de synchroniser les messages jusqu’à ce que la montre soit prête.
ja: Apple Watchは単独モードに切り替わり、直接受信の準備中です。準備が完了するまでiPhoneは同期を継続します。
ko: Apple Watch가 독립 모드로 전환되어 직접 수신을 준비 중입니다. 준비가 완료될 때까지 iPhone이 동기화를 계속합니다.
zh_hans: Apple Watch 已切换到独立模式，正在准备直接接收。手表就绪前 iPhone 会继续同步消息。
zh_hant: Apple Watch 已切換到獨立模式，正在準備直接接收。手錶就緒前 iPhone 會持續同步訊息。

source: Apple Watch Standalone Mode
de: Apple Watch Standalone-Modus
es: Modo independiente de Apple Watch
fr: Mode autonome Apple Watch
ja: Apple Watch単独モード
ko: Apple Watch 독립 모드
zh_hans: Apple Watch 独立模式
zh_hant: Apple Watch 獨立模式

# approval_pending_light_reminder
source: Pending approval, gentle reminder
de: Freigabe ausstehend, sanfte Erinnerung
es: Aprobación pendiente, recordatorio suave
fr: En attente d’approbation, rappel léger
ja: 承認待ちのやさしいリマインダー
ko: 승인 대기, 부드러운 알림
zh_hans: 待审批，温和提醒
zh_hant: 待審核，溫和提醒

source: Archived
de: Archiviert
es: Archivado
fr: Archivé
ja: アーカイブ済み
ko: 보관됨
zh_hans: 已存档
zh_hant: 已封存

# are_you_sure_you_want_to_delete_this_message_once_deleted_it_cannot_be_recovered
source: Delete this message? This cannot be undone.
de: Diese Nachricht löschen? Das kann nicht rückgängig gemacht werden.
es: ¿Eliminar este mensaje? Esta acción no se puede deshacer.
fr: Supprimer ce message ? Cette action est irréversible.
ja: このメッセージを削除しますか？元に戻せません。
ko: 이 메시지를 삭제하시겠습니까? 되돌릴 수 없습니다.
zh_hans: 确定删除这条消息？操作不可恢复。
zh_hant: 確定刪除這則訊息？操作不可復原。

source: attrs
de: Attribute
es: atributos
fr: attributs

# auto_cleanup_manual_suggestion
source: Messages are getting slow. You can manually clean up older messages.
de: Nachrichten werden langsamer. Du kannst ältere Nachrichten manuell bereinigen.
es: Los mensajes van más lentos. Puedes limpiar manualmente los mensajes antiguos.
fr: Les messages deviennent lents. Vous pouvez nettoyer manuellement les anciens messages.
ja: 表示が遅くなっています。古いメッセージを手動で整理できます。
ko: 메시지 표시가 느립니다. 오래된 메시지를 수동으로 정리할 수 있습니다.
zh_hans: 消息变慢了，你可以手动清理较早的消息。
zh_hant: 訊息變慢了，你可以手動清理較早的訊息。

# auto_cleanup_messages
source: Auto-clean read messages
de: Gelesene Nachrichten automatisch bereinigen
es: Limpiar automáticamente mensajes leídos
fr: Nettoyer automatiquement les messages lus
ja: 既読メッセージを自動整理
ko: 읽은 메시지 자동 정리
zh_hans: 自动清理已读消息
zh_hant: 自動清理已讀訊息

# auto_cleanup_messages_hint
source: When queries slow down, auto cleanup removes the oldest read messages. It keeps a large history, so recent messages are safe. Disable auto cleanup per channel if you need to keep everything.
de: Wenn Abfragen langsamer werden, löscht die automatische Bereinigung die ältesten gelesenen Nachrichten. Es bleibt ein großer Verlauf erhalten, sodass aktuelle Nachrichten in der Regel nicht gelöscht werden. Für Kanäle, die Sie behalten möchten, können Sie die automatische Bereinigung dort deaktivieren.
es: Cuando las consultas se vuelven más lentas, la limpieza automática elimina los mensajes leídos más antiguos. Se conserva un historial amplio, por lo que los mensajes recientes normalmente no se eliminan. Para canales que necesiten conservarse, desactiva la limpieza automática en la configuración del canal.
fr: Lorsque les requêtes ralentissent, le nettoyage automatique supprime les messages lus les plus anciens. Un historique important est conservé, donc les messages récents ne sont généralement pas supprimés. Pour les chaînes à conserver, désactivez le nettoyage automatique dans les paramètres de la chaîne.
ja: 検索が遅くなると、最も古い既読メッセージを自動で整理します。十分な履歴は保持され、最近のメッセージは基本的に削除されません。特定のチャンネルを残したい場合は、そのチャンネルで自動整理をオフにできます。
ko: 조회가 느려지면 가장 오래된 읽음 메시지를 자동으로 정리합니다. 충분한 기록을 유지하므로 최근 메시지는 일반적으로 삭제되지 않습니다. 보관이 필요한 채널은 채널 설정에서 자동 정리를 끌 수 있습니다.
zh_hans: 检测到查询变慢时，会自动清理最早的已读消息。系统会保留较大量的历史记录，近期消息通常不会被删除。如需保留某个频道的消息，可在频道设置中关闭自动清理。
zh_hant: 偵測到查詢變慢時，會自動清理最早的已讀訊息。系統會保留較大量的歷史記錄，近期訊息通常不會被刪除。如需保留某個頻道的訊息，可在頻道設定中關閉自動清理。

# auto_cleanup_suggestion
source: Messages are getting slow. Clear history or enable auto-cleanup.
de: Nachrichten werden langsamer. Verlauf löschen oder automatische Bereinigung aktivieren.
es: Los mensajes van más lentos. Borra el historial o activa la limpieza automática.
fr: Les messages deviennent lents. Effacez l’historique ou activez le nettoyage automatique.
ja: 表示が遅くなっています。履歴を整理するか自動整理を有効にしてください。
ko: 메시지 표시가 느립니다. 기록을 정리하거나 자동 정리를 켜주세요.
zh_hans: 消息变慢了，请清理历史消息或开启自动清理。
zh_hant: 訊息變慢了，請清理歷史訊息或開啟自動清理。

# automatically_generated_after_granting_notification_permission
source: Automatically generated after granting permission
de: Wird nach Erteilen der Berechtigung automatisch erzeugt
es: Se genera automáticamente tras conceder el permiso
fr: Généré automatiquement après l’octroi de l’autorisation
ja: 許可すると自動生成
ko: 권한을 허용하면 자동 생성
zh_hans: 授予权限后自动生成
zh_hant: 授權後自動生成

# available_ringtones
source: System ringtones
de: Systemklingeltöne
es: Tonos del sistema
fr: Sonneries système
ja: システム着信音
ko: 시스템 벨소리
zh_hans: 系统内置铃声
zh_hant: 系統內建鈴聲

# batch_delete_selected_events_confirm
source: Delete %lld selected events?
de: %lld ausgewählte Ereignisse löschen?
es: ¿Eliminar %lld eventos seleccionados?
fr: Supprimer %lld événements sélectionnés ?
ja: 選択した %lld 件のイベントを削除しますか？
ko: 선택한 %lld개의 이벤트를 삭제하시겠습니까?
zh_hans: 确认删除已选择的 %lld 条事件？
zh_hant: 確認刪除已選擇的 %lld 條事件？

# batch_delete_selected_messages_confirm
source: Delete %lld selected messages?
de: %lld ausgewählte Nachrichten löschen?
es: ¿Eliminar %lld mensajes seleccionados?
fr: Supprimer %lld messages sélectionnés ?
ja: 選択した %lld 件のメッセージを削除しますか？
ko: 선택한 %lld개의 메시지를 삭제하시겠습니까?
zh_hans: 确认删除已选择的 %lld 条消息？
zh_hant: 確認刪除已選擇的 %lld 條消息？

# batch_delete_selected_things_confirm
source: Delete %lld selected objects?
de: %lld ausgewählte Objekte löschen?
es: ¿Eliminar %lld objetos seleccionados?
fr: Supprimer %lld objets sélectionnés ?
ja: 選択した %lld 件のオブジェクトを削除しますか？
ko: 선택한 %lld개의 객체를 삭제하시겠습니까?
zh_hans: 确认删除已选择的 %lld 个对象？
zh_hant: 確認刪除已選擇的 %lld 個對象？

# batch_selected_count
source: %lld selected
de: %lld ausgewählt
es: %lld seleccionados
fr: %lld sélectionnés
ja: %lld 件を選択
ko: %lld개 선택됨
zh_hans: 已选择 %lld 项
zh_hant: 已選擇 %lld 項

source: Body
de: Inhalt
es: Contenido
fr: Contenu
ja: 本文
ko: 본문
zh_hans: 正文
zh_hant: 正文

# body_md_blocks_item1
source: Paragraphs, headings `#..######`, horizontal rules `---` / `***` / `___`
de: Absätze, Überschriften `#..######`, horizontale Trennlinien `---` / `***` / `___`
es: Párrafos, encabezados `#..######`, separadores horizontales `---` / `***` / `___`
fr: Paragraphes, titres `#..######`, séparateurs horizontaux `---` / `***` / `___`
ja: 段落、見出し `#..######`、区切り線 `---` / `***` / `___`
ko: 단락, 제목 `#..######`, 구분선 `---` / `***` / `___`
zh_hans: 段落、标题 `#..######`、分割线 `---` / `***` / `___`
zh_hant: 段落、標題 `#..######`、分隔線 `---` / `***` / `___`

# body_md_blocks_item2
source: Single-level lists `-/*` or `1.`, blockquote `>`, callout `[!info/success/warning/error]`
de: Einstufige Listen `-/*` oder `1.`, Blockzitat `>`, Hinweisblock `[!info/success/warning/error]`
es: Listas de un nivel `-/*` o `1.`, cita en bloque `>`, aviso `[!info/success/warning/error]`
fr: Listes à un seul niveau `-/*` ou `1.`, citation `>`, encadré `[!info/success/warning/error]`
ja: 単層リスト `-/*` または `1.`、引用 `>`、Callout `[!info/success/warning/error]`
ko: 단일 레벨 리스트 `-/*` 또는 `1.`, 인용 `>`, Callout `[!info/success/warning/error]`
zh_hans: 单层列表 `-/*` 或 `1.`、引用 `>`、Callout `[!info/success/warning/error]`
zh_hant: 單層列表 `-/*` 或 `1.`、引用 `>`、Callout `[!info/success/warning/error]`

# body_md_blocks_item3
source: Simple tables like `| A | B |`, up to 3 columns / 10 rows
de: Einfache Tabellen wie `| A | B |`, bis zu 3 Spalten / 10 Zeilen
es: Tablas simples como `| A | B |`, hasta 3 columnas / 10 filas
fr: Tableaux simples comme `| A | B |`, jusqu’à 3 colonnes / 10 lignes
ja: シンプル表 `| A | B |`、最大3列・10行
ko: 간단한 표 `| A | B |`, 최대 3열·10행
zh_hans: 极简表格如 `| A | B |`，最多 3 列、10 行
zh_hant: 極簡表格如 `| A | B |`，最多 3 欄、10 行

# body_md_fallback_note
source: If parsing fails or the client does not support Markdown, we fall back to plaintext (body / ciphertext.body).
de: Wenn das Parsen fehlschlägt oder Markdown nicht unterstützt wird, wird auf Klartext zurückgefallen (body / ciphertext.body).
es: Si falla el análisis o el cliente no admite Markdown, se usa texto plano (body / ciphertext.body).
fr: Si l’analyse échoue ou si le client ne prend pas en charge Markdown, retour au texte brut (body / ciphertext.body).
ja: 解析失敗や非対応端末ではプレーンテキスト（body / ciphertext.body）にフォールバックします。
ko: 파싱 실패나 미지원 기기에서는 플레인 텍스트(body / ciphertext.body)로 돌아갑니다.
zh_hans: 解析失败或客户端不支持 Markdown 时，会回退到纯文本（body / ciphertext.body）。
zh_hant: 解析失敗或客戶端不支援 Markdown 時，會回退到純文本（body / ciphertext.body）。

# body_md_inlines_item1
source: `**bold**`, `*italic*`, `~~strikethrough~~`, `==highlight==`, `inline code`
de: `**fett**`, `*kursiv*`, `~~durchgestrichen~~`, `==hervorgehoben==`, `Inline-Code`
es: `**negrita**`, `*cursiva*`, `~~tachado~~`, `==resaltado==`, `código en línea`
fr: `**gras**`, `*italique*`, `~~barré~~`, `==surligné==`, `code en ligne`
ja: `**太字**`、`*斜体*`、`~~取り消し線~~`、`==ハイライト==`、`インラインコード`
ko: `**굵게**`, `*이탤릭*`, `~~취소선~~`, `==하이라이트==`, `인라인 코드`
zh_hans: `**粗体**`、`*斜体*`、`~~删除线~~`、`==高亮==`、`行内代码`
zh_hant: `**粗體**`、`*斜體*`、`~~刪除線~~`、`==螢光==`、`行內程式碼`

# body_md_inlines_item2
source: `[links](https://example.com)`, `@mention`, `#tag`, auto URL/email/phone
de: `[Links](https://example.com)`, `@Erwähnung`, `#Tag`, automatische URL/E-Mail/Telefonerkennung
es: `[enlaces](https://example.com)`, `@mención`, `#etiqueta`, detección automática de URL/correo/teléfono
fr: `[liens](https://example.com)`, `@mention`, `#tag`, détection auto URL/e-mail/téléphone
ja: `[リンク](https://example.com)`、`@mention`、`#tag`、自動 URL/メール/電話検出
ko: `[링크](https://example.com)`, `@mention`, `#tag`, URL/이메일/전화 자동 인식
zh_hans: `[链接](https://example.com)`、`@mention`、`#tag`、自动识别 URL/邮箱/电话
zh_hant: `[連結](https://example.com)`、`@mention`、`#tag`、自動識別 URL/Email/電話

# body_md_limits_item1
source: Code blocks / images / HTML are not parsed; they show as plain text
de: Codeblöcke / Bilder / HTML werden nicht geparst und als Klartext angezeigt
es: Los bloques de código / imágenes / HTML no se analizan; se muestran como texto plano
fr: Les blocs de code / images / HTML ne sont pas analysés ; ils s’affichent en texte brut
ja: コードブロック/画像/HTML は解析せずプレーン表示
ko: 코드블록/이미지/HTML은 파싱하지 않고 텍스트로 표시
zh_hans: 不解析代码块/图片/HTML，按纯文本展示
zh_hant: 不解析程式碼區塊/圖片/HTML，直接以純文本顯示

# body_md_limits_item2
source: Recommend <= 2000 chars; body may contain PushGo Markdown v1 (auto-detected)
de: Empfohlen: <= 2000 Zeichen; Body kann PushGo Markdown v1 enthalten (automatisch erkannt)
es: Recomendado: <= 2000 caracteres; el body puede contener PushGo Markdown v1 (detección automática)
fr: Recommandé : <= 2000 caractères ; le corps peut contenir PushGo Markdown v1 (détection automatique)
ja: 推奨長さ 2000 文字以内；body は PushGo Markdown v1 を含めてもOK（自動検出）
ko: 권장 길이 2000자 이하; body는 PushGo Markdown v1 포함 가능(자동 감지)
zh_hans: 建议长度 ≤ 2000 字符；body 可包含 PushGo Markdown v1（自动检测）
zh_hant: 建議長度 ≤ 2000 字元；body 可包含 PushGo Markdown v1（自動檢測）

# body_md_limits_item3
source: Client priority: ciphertext.body > body
de: Client-Priorität: ciphertext.body > body
es: Prioridad del cliente: ciphertext.body > body
fr: Priorité du client : ciphertext.body > body
ja: クライアント優先度: ciphertext.body > body
ko: 클라이언트 우선순위: ciphertext.body > body
zh_hans: 客户端优先级：ciphertext.body > body
zh_hant: 客戶端優先級：ciphertext.body > body

# bright_cute_chime
source: Bright and cute chime
de: Heller, verspielter Klingelton
es: Tono brillante y simpático
fr: Sonnerie claire et légère
ja: 明るく可愛いチャイム
ko: 밝고 귀여운 차임
zh_hans: 明亮可爱铃声
zh_hant: 明亮可愛鈴聲

source: Built-in ringtone
de: Integrierter Klingelton
es: Tono integrado
fr: Sonnerie intégrée
ja: 内蔵着信音
ko: 내장 벨소리
zh_hans: 内置铃声
zh_hant: 內建鈴聲

# by_server
source: By gateway
de: Über Gateway
es: Por gateway
fr: Via la passerelle
ja: ゲートウェイ別
ko: 게이트웨이별
zh_hans: 按网关
zh_hant: 按網關

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hant: 取消

# cartoon_blinking_tick
source: Cartoon-style ticking chime
de: Cartoon-artiger Tick-Ton
es: Tono tic-tac estilo caricatura
fr: Carillon tic-tac style cartoon
ja: カートゥーン風チック音
ko: 만화풍 틱틱 소리
zh_hans: 卡通滴答声
zh_hant: 卡通滴答聲

source: Category
de: Kategorie
es: Categoría
fr: Catégorie
ja: カテゴリ
ko: 카테고리
zh_hans: 分类
zh_hant: 分類

source: Change chain
de: Änderungskette
es: Cadena de cambios
fr: Chaîne de changements
ja: 変更チェーン
ko: 변경 체인
zh_hans: 变更链
zh_hant: 變更鏈

source: Changed attrs
de: Geänderte Attribute
es: Atributos modificados
fr: Attributs modifiés
ja: 変更属性
ko: 변경 속성
zh_hans: 变更属性
zh_hant: 變更屬性

source: Channel
de: Kanal
es: Canal
fr: Canal
ja: チャンネル
ko: 채널
zh_hans: 频道
zh_hant: 頻道

# channel_create_hint
source: Create a new channel with this alias.
de: Neuen Kanal mit diesem Alias erstellen.
es: Crear un canal nuevo con este alias.
fr: Créer un nouveau canal avec cet alias.
ja: このエイリアスで新しいチャンネルを作成します。
ko: 이 별칭으로 새 채널을 만듭니다.
zh_hans: 使用该别名创建新频道。
zh_hant: 使用此別名建立新頻道。

# channel_create_password_hint
source: Channel not found. Set a password to create it.
de: Kanal nicht gefunden. Lege ein Passwort fest, um ihn zu erstellen.
es: Canal no encontrado. Define una contraseña para crearlo.
fr: Canal introuvable. Définissez un mot de passe pour le créer.
ja: チャンネルが見つかりません。パスワードを設定して作成します。
ko: 채널을 찾을 수 없습니다. 비밀번호를 설정해 생성하세요.
zh_hans: 未找到频道。设置密码以创建该频道。
zh_hant: 找不到頻道。設定密碼以建立該頻道。

source: Channel created and subscribed.
de: Kanal erstellt und abonniert.
es: Canal creado y suscrito.
fr: Canal créé et abonnement effectué.
ja: チャンネルを作成して購読しました。
ko: 채널을 만들고 구독했습니다.
zh_hans: 频道已创建并订阅。
zh_hant: 頻道已建立並訂閱。

# channel_exists_name_placeholder
source: Channel name: %@
de: Kanalname: %@
es: Nombre del canal: %@
fr: Nom du canal : %@
ja: チャンネル名: %@
ko: 채널 이름: %@
zh_hans: 频道名称：%@
zh_hant: 頻道名稱：%@

# channel_exists_password_hint
source: Channel exists. Enter the password to subscribe.
de: Kanal existiert. Passwort eingeben, um zu abonnieren.
es: El canal ya existe. Introduce la contraseña para suscribirte.
fr: Le canal existe déjà. Saisissez le mot de passe pour vous abonner.
ja: チャンネルが存在します。パスワードを入力して購読します。
ko: 채널이 존재합니다. 비밀번호를 입력해 구독하세요.
zh_hans: 频道已存在。输入密码即可订阅。
zh_hant: 頻道已存在。輸入密碼即可訂閱。

source: Channel ID
de: Kanal-ID
es: ID del canal
fr: ID du canal
ja: チャンネル ID
ko: 채널 ID
zh_hans: 频道 ID
zh_hant: 頻道 ID

source: Channel ID copied
de: Kanal-ID kopiert
es: ID del canal copiado
fr: ID du canal copiée
ja: チャンネル ID をコピーしました
ko: 채널 ID가 복사되었습니다
zh_hans: 频道 ID 已复制
zh_hant: 頻道 ID 已複製

# channel_id_invalid
source: Invalid channel ID
de: Ungültige Kanal-ID
es: ID de canal no válida
fr: ID de canal invalide
ja: 無効なチャンネル ID
ko: 잘못된 채널 ID
zh_hans: 无效的频道 ID
zh_hant: 無效的頻道 ID

# channel_id_placeholder
source: Enter a 26-character channel ID
de: 26-stellige Kanal-ID eingeben
es: Introduce un ID de canal de 26 caracteres
fr: Saisissez un ID de canal de 26 caractères
ja: 26文字のチャンネルIDを入力
ko: 26자 채널 ID를 입력하세요
zh_hans: 请输入 26 字符的频道 ID
zh_hant: 請輸入 26 字元的頻道 ID

# channel_id_required
source: Channel ID is required.
de: Kanal-ID ist erforderlich.
es: Se requiere ID del canal.
fr: L’ID du canal est requise.
ja: チャンネル ID は必須です。
ko: 채널 ID는 필수입니다.
zh_hans: 频道 ID 为必填项。
zh_hant: 頻道 ID 為必填。

# channel_join_hint
source: Enter a channel ID to join.
de: Kanal-ID eingeben, um beizutreten.
es: Introduce un ID de canal para unirte.
fr: Saisissez un ID de canal pour rejoindre.
ja: 参加するにはチャンネル ID を入力してください。
ko: 가입하려면 채널 ID를 입력하세요.
zh_hans: 输入频道 ID 以加入。
zh_hant: 輸入頻道 ID 以加入。

# channel_list_empty_hint
source: Create or subscribe to a channel first to receive pushes.
de: Erstelle oder abonniere zuerst einen Kanal, um Pushes zu empfangen.
es: Primero crea o suscríbete a un canal para recibir notificaciones push.
fr: Créez ou abonnez-vous d’abord à un canal pour recevoir les notifications push.
ja: プッシュを受け取るには、先にチャンネルを作成または購読してください。
ko: 푸시를 받으려면 먼저 채널을 만들거나 구독하세요.
zh_hans: 请先创建或订阅频道以接收推送。
zh_hant: 請先建立或訂閱頻道以接收推送。

# channel_mode_create
source: Create
de: Erstellen
es: Crear
fr: Créer
ja: 作成
ko: 생성
zh_hans: 创建
zh_hant: 建立

# channel_mode_join
source: Join
de: Beitreten
es: Unirse
fr: Rejoindre
ja: 参加
ko: 가입
zh_hans: 加入
zh_hant: 加入

source: Channel name
de: Kanalname
es: Nombre del canal
fr: Nom du canal
ja: チャンネル名
ko: 채널 이름
zh_hans: 频道名称
zh_hant: 頻道名稱

# channel_name_invalid_character_placeholder
source: Channel name contains invalid character: %@
de: Kanalname enthält ungültiges Zeichen: %@
es: El nombre del canal contiene un carácter no válido: %@
fr: Le nom du canal contient un caractère invalide : %@
ja: チャンネル名に無効な文字が含まれています: %@
ko: 채널 이름에 잘못된 문자가 포함되어 있습니다: %@
zh_hans: 频道名称包含无效字符：%@
zh_hant: 頻道名稱包含無效字元：%@

# channel_name_placeholder
source: Friendly name for this channel
de: Anzeigename für diesen Kanal
es: Nombre visible para este canal
fr: Nom d’affichage pour ce canal
ja: このチャンネルの表示名
ko: 이 채널의 표시 이름
zh_hans: 为该频道设置名称
zh_hant: 為此頻道設定名稱

# channel_name_required
source: Channel name is required.
de: Kanalname ist erforderlich.
es: Se requiere nombre del canal.
fr: Le nom du canal est requis.
ja: チャンネル名は必須です。
ko: 채널 이름은 필수입니다.
zh_hans: 频道名称为必填项。
zh_hant: 頻道名稱為必填。

# channel_name_too_long
source: Channel name is too long (max %d).
de: Kanalname ist zu lang (max. %d).
es: El nombre del canal es demasiado largo (máx. %d).
fr: Le nom du canal est trop long (max. %d).
ja: チャンネル名が長すぎます（最大 %d）。
ko: 채널 이름이 너무 깁니다(최대 %d).
zh_hans: 频道名称过长（最多 %d）。
zh_hant: 頻道名稱過長（最多 %d）。

# channel_name_unknown
source: Unknown
de: Unbekannt
es: Desconocido
fr: Inconnu
ja: 不明
ko: 알 수 없음
zh_hans: 未知
zh_hant: 未知

source: Channel not found.
de: Kanal nicht gefunden.
es: Canal no encontrado.
fr: Canal introuvable.
ja: チャンネルが見つかりません。
ko: 채널을 찾을 수 없습니다.
zh_hans: 未找到频道。
zh_hant: 找不到頻道。

source: Channel password
de: Kanalpasswort
es: Contraseña del canal
fr: Mot de passe du canal
ja: チャンネルパスワード
ko: 채널 비밀번호
zh_hans: 频道密码
zh_hant: 頻道密碼

# channel_password_invalid_length
source: Channel password must be 8-128 characters.
de: Kanalpasswort muss 8–128 Zeichen lang sein.
es: La contraseña del canal debe tener entre 8 y 128 caracteres.
fr: Le mot de passe du canal doit contenir entre 8 et 128 caractères.
ja: チャンネルパスワードは 8〜128 文字で入力してください。
ko: 채널 비밀번호는 8~128자여야 합니다.
zh_hans: 频道密码需为 8-128 个字符。
zh_hant: 頻道密碼需為 8-128 個字元。

# channel_password_mismatch_removed
source: Channel password mismatch. Removed local subscriptions: %@
de: Kanalpasswort stimmt nicht überein. Lokale Abos entfernt: %@
es: La contraseña del canal no coincide. Suscripciones locales eliminadas: %@
fr: Le mot de passe du canal ne correspond pas. Abonnements locaux supprimés : %@
ja: チャンネルパスワード不一致のため、ローカル購読を削除しました: %@
ko: 채널 비밀번호가 일치하지 않아 로컬 구독을 제거했습니다: %@
zh_hans: 频道密码不匹配，已移除本地订阅：%@
zh_hant: 頻道密碼不一致，已移除本地訂閱：%@

source: Channel password missing
de: Kanalpasswort fehlt
es: Falta la contraseña del canal
fr: Mot de passe du canal manquant
ja: チャンネルパスワードがありません
ko: 채널 비밀번호가 없습니다
zh_hans: 缺少频道密码
zh_hant: 缺少頻道密碼

# channel_password_placeholder
source: Enter password
de: Passwort eingeben
es: Introduce la contraseña
fr: Saisir le mot de passe
ja: パスワードを入力
ko: 비밀번호 입력
zh_hans: 输入密码
zh_hant: 輸入密碼

# channel_placeholder
source: channel-name
de: kanal-name
es: nombre-canal
fr: nom-canal
ja: チャンネル名
ko: 채널 이름
zh_hans: 频道名称
zh_hant: 頻道名稱
